tutorials/twoFluidsNBSuspensionFoam/herringboneChannels/channel2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      10;
        nAlphaSubCycles 10;
        nAlphaOffDiagCorr 4;


        smoothLimiter   0.3;

        implicitPhasePressure no;
        solver          GAMG;
        smoother        GaussSeidel;
        preconditioner	diagonal;
        tolerance       1e-7;
        relTol          0;
        minIter         0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0.1;
        maxIter         50;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
        maxIter 200;
    }

    "U.*|Theta.*"
    {
        solver          PBiCGStab;
        preconditioner  diagonal;
        tolerance       1e-9;
        relTol          0;
        minIter         1;
    }



}

PIMPLE
{
    nOuterCorrectors    3;
    nCorrectors         5;
    nNonOrthogonalCorrectors 8;
    pRefCell 0;
    pRefValue 1e5;
    faceMomentum  on;

    residualControl
    {
        p_rgh           1e-5;
        "U.*"           1e-5;
 //       "alpha.*"       1e-3;
    }

}

relaxationFactors
{
    equations
    {

         "U.fluid|U.particles"  0.8;
         p_rgh        1;

         "(U.fluid|U.particles)Final"  1;
         p_rghFinal 1;
    }
}


// ************************************************************************* //
